vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1186_DFP.pdsc
              Write32(0x5201002C, 0x00000000);    // DMA4.TCD[0].SLAST_SGA
              Write32(0x52010038, 0x00000000);    // DMA4.TCD[0].DLAST_SGA
              
              Write32(0x52010000, 0x40000000);    // DMA4.TCD[0].CH_CSR
              
              Write32(0x52010020, 0x20484000);    // DMA4.TCD[0].SADDR
              Write32(0x52010030, targetAddr);    // DMA4.TCD[0].DADDR
              Write32(0x52010028, 0x40000);       // DMA4.TCD[0].NBYTES_MLOFFNO
              Write16(0x52010036, 0x1);           // DMA4.TCD[0].ELINKNO
              Write16(0x5201003E, 0x1);           // DMA4.TCD[0].BITER_ELINKNO
              Write16(0x52010026, 0x0303);        // DMA4.TCD[0].ATTR
              Write16(0x52010024, 0x0);           // DMA4.TCD[0].SOFF
              Write16(0x52010034, 0x8);           // DMA4.TCD[0].DOFF
              Write32(0x52010000, 0x7);           // DMA4.TDC[0].CH_CSR
              Write16(0x5201003C, 0x8);           // DMA4.TCD[0].CSR
              Write16(0x5201003C, 0x9);           // DMA4.TCD[0].CSR
            </block>
            <control while="(Read32(0x52010000) &amp; 0x40000000) == 0" timeout="1000000"/>
            <block>Write32(0x52010000, 0x40000000);    // DMA4.TDC[0].CH_CSR, clear DONE flag</block>
            <block>
              targetAddr = 0x30400000;
              Write32(0x52010000, 0x40000000);    // DMA4.TDC[0].CH_CSR, clear DONE flag
              
              Write32(0x5201002C, 0x00000000);    // DMA4.TCD[0].SLAST_SGA
              Write32(0x52010038, 0x00000000);    // DMA4.TCD[0].DLAST_SGA
              
              Write32(0x52010000, 0x40000000);    // DMA4.TCD[0].CH_CSR
              
              Write32(0x52010020, 0x20484000);    // DMA4.TCD[0].SADDR
              Write32(0x52010030, targetAddr);    // DMA4.TCD[0].DADDR
              Write32(0x52010028, 0x40000);       // DMA4.TCD[0].NBYTES_MLOFFNO
              Write16(0x52010036, 0x1);           // DMA4.TCD[0].ELINKNO
              Write16(0x5201003E, 0x1);           // DMA4.TCD[0].BITER_ELINKNO
              Write16(0x52010026, 0x0303);        // DMA4.TCD[0].ATTR
              Write16(0x52010024, 0x0);           // DMA4.TCD[0].SOFF
              Write16(0x52010034, 0x8);           // DMA4.TCD[0].DOFF
              Write32(0x52010000, 0x7);           // DMA4.TDC[0].CH_CSR
              Write16(0x5201003C, 0x8);           // DMA4.TCD[0].CSR
              Write16(0x5201003C, 0x9);           // DMA4.TCD[0].CSR
            </block>
            <control while="(Read32(0x52010000) &amp; 0x40000000) == 0" timeout="1000000"/>
            <block>
              Write32(0x52010000, 0x40000000);    // DMA4.TDC[0].CH_CSR, clear DONE flag
              
              Message(0, "  CM7 TCM is initialized");
              
              __ap = 2;
            </block>
          </sequence>
          <sequence name="KickOffCM7">
            <block>
              __var resp1 = 0;
              __var resp2 = 0;
              
              __ap = 3;
              
              // Clock Preparation
              Write32(0x54484350, 0x0);     // ROSC400M_CTRL1
              Write32(0x54450000, 0x100);   // CLOCK_ROOT[0].CONTROL, CM7
              
              // VTOR 0x00
              Write32(0x544F0080, 0x0010);  // BLK_CTRL_S_AONMIX.M7_CFG
              
              // Release CM7
              Write32(0x54460010, 0x1);     // SRC_GENERAL_REG.SCR
              
              // Making Landing Zone
              Write32(0x303C0000, 0x20000000);
              Write32(0x303C0004, 0x00000009);
              Write32(0x303C0008, 0xE7FEE7FE);
              
              // Trigger ELE
              Write32(0x57540200, 0x17d20106);  // MU_RT_S3MUA.TR[0]
              resp1 = Read32(0x57540280);       // MU_RT_S3MUA.RR[1]
              resp2 = Read32(0x57540284);       // MU_RT_S3MUA.RR[1]
              
              // Deassert CM7 Wait
              Write32(0x544F0080, 0x0);  // BLK_CTRL_S_AONMIX.M7_CFG
              
              Message(0, "  CM7 is kicked-off");
              
              __ap = 2;
            </block>
          </sequence>
          <sequence Pname="cm33" name="StartCM7">
            <block>
    </block>
          </sequence>
          <sequence Pname="cm7" name="StartCM7">
            <block>
              __var resp1 = 0;
              __var resp2 = 0;
              __var reg = 0;
              
              // switch to CM33 AP port first
              __dp = 0;
              __ap = 3;
              
              reg = Read32(0x544F0080);  // BLK_CTRL_S_AONMIX.M7_CFG
            </block>
            <control if="(reg &amp; 0x10) == 0">
              <block>Message(0, "  CM7 is running already");</block>
            </control>
            <control if="(reg &amp; 0x10) == 0x10">
              <block>
                // Clock Preparation
                Write32(0x54484350, 0x0);     // ROSC400M_CTRL1
                Write32(0x54450000, 0x100);   // CLOCK_ROOT[0].CONTROL, CM7
                
                // VTOR 0x00
                Write32(0x544F0080, 0x0010);  // BLK_CTRL_S_AONMIX.M7_CFG
                
                // Release CM7
                Write32(0x54460010, 0x1);     // SRC_GENERAL_REG.SCR
                
                // DMA initialization
                Sequence("InitCM7TCM");
                
                // Making Landing Zone
                Write32(0x303C0000, 0x20000000);
                Write32(0x303C0004, 0x00000009);
                Write32(0x303C0008, 0xE7FEE7FE);
                
                // Trigger ELE
                Write32(0x57540200, 0x17d20106);  // MU_RT_S3MUA.TR[0]
                resp1 = Read32(0x57540280);       // MU_RT_S3MUA.RR[1]
                resp2 = Read32(0x57540284);       // MU_RT_S3MUA.RR[1]
                
                // Deassert CM7 Wait
                Write32(0x544F0080, 0x0);  // BLK_CTRL_S_AONMIX.M7_CFG
                
