vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1186_DFP.pdsc
    <condition id="allOf.component.log, driver.common, utility.debug_console_lite, device=MIMXRT1186.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.component.log, driver.common, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, device=MIMXRT1186.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.lpi2c_adapter.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MIMXRT1186.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.lpit_adapter.condition_id">
      <require condition="allOf.driver.lpit, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpit, device=MIMXRT1186.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpit"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.lptmr_adapter.condition_id">
      <require condition="allOf.driver.lptmr, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lptmr, device=MIMXRT1186.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.lpuart_adapter.condition_id">
      <require condition="allOf.anyOf=driver.lpuart, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpuart, device=MIMXRT1186.internal_condition">
      <require condition="anyOf.driver.lpuart.internal_condition"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="component.mcxw_flash_adapter.condition_id">
      <require condition="allOf.driver.romapi, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.driver.romapi, device=MIMXRT1186.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, driver.cache_xcache, driver.flexspi, driver.romapi, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, driver.cache_xcache, driver.flexspi, driver.romapi, device=MIMXRT1186.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7, driver.cache_xcache, driver.flexspi, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.cache_xcache, driver.flexspi, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="allOf.boards=frdmimxrt1186.condition_id">
      <require condition="boards.frdmimxrt1186.internal_condition"/>
    </condition>
    <condition id="boards.frdmimxrt1186.internal_condition">
      <accept condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, driver.cache_xcache, driver.romapi, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, driver.cache_xcache, driver.romapi, device=MIMXRT1186.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7, driver.cache_xcache, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.cache_xcache, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.phyaqr113c.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.component.eth_phy_common, device=MIMXRT1186.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
