vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1186_DFP.pdsc
    <condition id="component.wifi_bt_module.config.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MIMXRT1186.internal_condition">
      <require condition="anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_88w8987"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw416"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw61x"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rw61x"/>
    </condition>
    <condition id="component.wifi_bt_module.nb_fw.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.wifi_fw.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MIMXRT1186.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="allOf.core_ids=cm33.condition_id">
      <require condition="core_ids.cm33.internal_condition"/>
    </condition>
    <condition id="core_ids.cm33.internal_condition">
      <accept Pname="cm33" Dname="*"/>
    </condition>
    <condition id="allOf.core_ids=cm7.condition_id">
      <require condition="core_ids.cm7.internal_condition"/>
    </condition>
    <condition id="core_ids.cm7.internal_condition">
      <accept Pname="cm7" Dname="*"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="device.boot_header.condition_id">
      <require condition="allOf.device=MIMXRT1186.internal_condition"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MIMXRT1186xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1186xxxxx.internal_condition">
      <require condition="device_id.MIMXRT1186xxxxx.internal_condition"/>
    </condition>
    <condition id="device_ids.MIMXRT1186xxxxx.internal_condition">
      <accept Dname="MIMXRT1186CVJ8C" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1186XVJ8C" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="device_ids.MIMXRT1186xxxxx.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="cores.cm33.internal_condition">
      <accept Dcore="Cortex-M33"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="device_ids.MIMXRT1186xxxxx.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="device_ids.MIMXRT1186xxxxx.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm7f.internal_condition"/>
      <require condition="device_ids.MIMXRT1186xxxxx.internal_condition"/>
    </condition>
    <condition id="cores.cm7f.internal_condition">
      <accept Dcore="Cortex-M7"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm7f.internal_condition"/>
      <require condition="device_ids.MIMXRT1186xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm7f.internal_condition"/>
      <require condition="device_ids.MIMXRT1186xxxxx.internal_condition"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.device_id=MIMXRT1186xxxxx, CMSIS_Include_core_cm, device.startup, driver.common, driver.clock, driver.rgpio, driver.iomuxc, driver.memory, driver.ele_base_api, driver.dcdc_3, driver.gpc_3, driver.anadig_pmu_1, driver.src_3, driver.misc, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str, anyOf=driver.cache_armv7_m7, driver.cache_xcache.internal_condition"/>
    </condition>
