vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1186_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1186_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT1186_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm33_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm33_ram.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm33_flexspi_nor_hyperram.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm33_hyperram.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm33_hyperram_txt.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm33_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm33_ram.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm33_flexspi_nor_hyperram.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm33_hyperram.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm33_hyperram_txt.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm33_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm33_ram.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm33_flexspi_nor_hyperram.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm33_hyperram.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm33_hyperram_txt.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm7_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm7_ram.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm7_flexspi_nor_hyperram.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm7_hyperram.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/arm/MIMXRT1186xxxxx_cm7_hyperram_txt.scf" version="1.0.0" projectpath="MIMXRT1186/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm7_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm7_ram.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm7_flexspi_nor_hyperram.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm7_hyperram.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/gcc/MIMXRT1186xxxxx_cm7_hyperram_txt.ld" version="1.0.0" projectpath="MIMXRT1186/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm7_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm7_ram.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm7_flexspi_nor_hyperram.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm7_hyperram.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1186xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1186/iar/MIMXRT1186xxxxx_cm7_hyperram_txt.icf" version="1.0.0" projectpath="MIMXRT1186/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1186" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT1186</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1186/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1186/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1186/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1186/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1186/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1186/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1186/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1186/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1186/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT1186_startup</description>
      <files>
        <file condition="allOf.toolchains=iar, core_ids=cm33.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1186/iar/startup_MIMXRT1186_cm33.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm33.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1186/gcc/startup_MIMXRT1186_cm33.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm33.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1186/arm/startup_MIMXRT1186_cm33.S" version="1.0.0" projectpath="startup/arm"/>
        <file condition="allOf.toolchains=iar, core_ids=cm7.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1186/iar/startup_MIMXRT1186_cm7.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm7.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1186/gcc/startup_MIMXRT1186_cm7.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm7.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1186/arm/startup_MIMXRT1186_cm7.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1186_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT1186_system</description>
      <files>
        <file condition="allOf.core_ids=cm33.condition_id" category="sourceC" name="devices/MIMXRT1186/system_MIMXRT1186_cm33.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33.condition_id" category="header" name="devices/MIMXRT1186/system_MIMXRT1186_cm33.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm7.condition_id" category="sourceC" name="devices/MIMXRT1186/system_MIMXRT1186_cm7.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm7.condition_id" category="header" name="devices/MIMXRT1186/system_MIMXRT1186_cm7.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1186/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
