vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1186_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpadc" Cversion="2.9.3" condition="driver.lpadc.condition_id">
      <description>LPADC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_lpadc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_lpadc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.6.2" condition="driver.lpi2c.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_lpi2c.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_lpi2c.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma" Cversion="2.4.4" condition="driver.lpi2c_edma.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_lpi2c_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_lpi2c_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpit" Cversion="2.1.2" condition="driver.lpit.condition_id">
      <description>LPIT Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_lpit.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_lpit.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi" Cversion="2.7.3" condition="driver.lpspi.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_lpspi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_lpspi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.4.9" condition="driver.lpspi_edma.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_lpspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_lpspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr" Cversion="2.2.1" condition="driver.lptmr.condition_id">
      <description>LPTMR Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_lptmr.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_lptmr.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.10.0" condition="driver.lpuart.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_lpuart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_lpuart.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.6.0" condition="driver.lpuart_edma.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_lpuart_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_lpuart_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lsm6dso" Cversion="1.0.0" condition="driver.lsm6dso.condition_id">
      <description>Driver lsm6dso</description>
      <files>
        <file category="header" name="components/sensor/lsm6dso/fsl_lsm.h" projectpath="tilt_pedo"/>
        <file category="sourceC" name="components/sensor/lsm6dso/fsl_lsm.c" projectpath="tilt_pedo"/>
        <file category="include" name="components/sensor/lsm6dso/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="max30101" Cversion="1.0.0" condition="driver.max30101.condition_id">
      <description>Driver max30101</description>
      <files>
        <file category="header" name="components/sensor/max30101/fsl_max.h" projectpath="heartrate"/>
        <file category="sourceC" name="components/sensor/max30101/fsl_max.c" projectpath="heartrate"/>
        <file category="include" name="components/sensor/max30101/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mecc" Cversion="2.1.1" condition="driver.mecc.condition_id">
      <description>MECC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_mecc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_mecc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
