vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1186_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="memory" Cversion="2.0.0" condition="driver.memory.condition_id">
      <description>MEMORY Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_memory.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_memory.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="misc" Cversion="2.0.0" condition="driver.misc.condition_id">
      <description>misc Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_misc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/sensor/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8652fc" Cversion="1.0.0" condition="driver.mma8652fc.condition_id">
      <description>Driver mma8652fc</description>
      <files>
        <file category="header" name="components/sensor/mma8652fc/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8652fc/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8652fc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="msgintr" Cversion="2.0.2" condition="driver.msgintr.condition_id">
      <description>MSGINTR Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_msgintr.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_msgintr.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mu" Cversion="2.8.0" condition="driver.mu1.condition_id">
      <description>MU Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_mu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_mu.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="netc" Cversion="2.10.2" condition="driver.netc.condition_id">
      <description>NETC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_netc.h" projectpath="drivers/netc"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_netc_ierb.h" projectpath="drivers/netc"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_netc_ierb.c" projectpath="drivers/netc"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_netc_timer.h" projectpath="drivers/netc"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_netc_timer.c" projectpath="drivers/netc"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_netc_mdio.h" projectpath="drivers/netc"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_netc_mdio.c" projectpath="drivers/netc"/>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_netc_endpoint.h" projectpath="drivers/netc"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_netc_endpoint.c" projectpath="drivers/netc"/>
        <file category="header" name="devices/MIMXRT1186/drivers/netc_hw/fsl_netc_hw.h" projectpath="drivers/netc/netc_hw" path="devices/MIMXRT1186/drivers"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/netc_hw/fsl_netc_hw.c" projectpath="drivers/netc/netc_hw"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/netc_hw/fsl_netc_hw_port.c" projectpath="drivers/netc/netc_hw"/>
        <file category="header" name="devices/MIMXRT1186/drivers/netc_hw/fsl_netc_hw_port.h" projectpath="drivers/netc/netc_hw" path="devices/MIMXRT1186/drivers"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/netc_hw/fsl_netc_hw_si.c" projectpath="drivers/netc/netc_hw"/>
        <file category="header" name="devices/MIMXRT1186/drivers/netc_hw/fsl_netc_hw_si.h" projectpath="drivers/netc/netc_hw" path="devices/MIMXRT1186/drivers"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/netc_hw/fsl_netc_hw_enetc.c" projectpath="drivers/netc/netc_hw"/>
        <file category="header" name="devices/MIMXRT1186/drivers/netc_hw/fsl_netc_hw_enetc.h" projectpath="drivers/netc/netc_hw" path="devices/MIMXRT1186/drivers"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="netc_imx952" Cversion="2.0.0" condition="driver.netc_imx952.condition_id">
      <description>Driver netc imx952</description>
      <files>
        <file category="doc" name="devices/MIMXRT1186/drivers/driver.netc_imx952_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="netc_msg" Cversion="2.8.1" condition="driver.netc_msg.condition_id">
      <description>NETC VSI-PSI Message Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_netc_msg.h" projectpath="drivers/netc"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_netc_msg.c" projectpath="drivers/netc"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="netc_phywrapper" Cversion="2.8.1" condition="driver.netc_phywrapper.condition_id">
      <description>NETC PHY Wrapper Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1186/drivers/fsl_netc_phy_wrapper.h" projectpath="drivers/netc"/>
        <file category="sourceC" name="devices/MIMXRT1186/drivers/fsl_netc_phy_wrapper.c" projectpath="drivers/netc"/>
        <file category="include" name="devices/MIMXRT1186/drivers/"/>
      </files>
    </component>
